numerical-tests/openfoam/radial-collapse-perfect-slip/water_collapse_parallel_N400/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (100 0 0)
    (0 2 0)
    (100 2 0)
    (0 0 100)
    (100 0 100)
    (0 2 100)
    (100 2 100)
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (400 400 400) simpleGrading (1 1 1)
);

defaultPatch
{
    type empty;
}

boundary
(
    leftwall
    {
        type wall;
        faces
        (
            (0 4 6 2)
        );
    }
    rightwall
    {
        type wall;
        faces
        (
            (3 7 5 1)
        );
    }
    frontwall
    {
        type wall;
        faces
        (
            (5 7 6 4)
        );
    }
    backwall
    {
        type wall;
        faces
        (
            (0 2 3 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (2 6 7 3)
        );
    }
);


// ************************************************************************* //
